<img src="Immagine1.png">

Import delle librerie

In [1]:
import pandas as pd
import re, math
import datetime as dt 
import numpy as np
import collections
from collections import Counter
import numpy as np
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.metrics.pairwise import cosine_similarity
pd.options.mode.chained_assignment = None

Import dei files

In [2]:
times= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\timesData.csv')
shanghai= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\shanghaiData.csv')
attainment= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\educational_attainment_supplementary_data.csv')
school_country= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\school_and_country_table.csv')
expenditure= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\education_expenditure_supplementary_data.csv',sep=',', lineterminator='\r')
cwur= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\cwurData.csv')

Esplorazione dei dataset

In [3]:
times.head(2)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011

check dei valori nulli per l'attributo university_name

In [4]:
times[times['university_name'].isnull()==True]

Empty DataFrame
Columns: [world_rank, university_name, country, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, international_students, female_male_ratio, year]
Index: []

In [5]:
shanghai.head(2)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005

check dei valori nulli per l'attributo university_name

In [6]:
shanghai[shanghai['university_name'].isnull()==True]

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
3896,99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013

Rimozione record con valori nulli e reset dell'index

In [7]:
shanghai.drop([3896],inplace = True)

In [8]:
shanghai.reset_index(drop=True,inplace=True)

In [9]:
cwur.head(2)

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012

In [10]:
cwur.rename(columns={'institution':'university_name'},inplace=True)

check dei valori nulli per l'attributo university_name

In [11]:
cwur[cwur['university_name'].isnull()==True]

Empty DataFrame
Columns: [world_rank, university_name, country, national_rank, quality_of_education, alumni_employment, quality_of_faculty, publications, influence, citations, broad_impact, patents, score, year]
Index: []

**Valutazione similarità tra i nomi delle università nei tre dataset**

Rimozione dei caratteri speciali nel nome delle univeristà e lowercase

In [12]:
shanghai['university_name'] = shanghai['university_name'].str.replace('[^A-Za-z0-9]', ' ').str.replace('  ', ' ').str.replace('   ', ' ').str.lower().str.strip()
times['university_name'] = times['university_name'].str.replace('[^A-Za-z0-9]', ' ').str.replace('  ', ' ').str.replace('   ', ' ').str.lower().str.strip()
cwur['university_name'] = cwur['university_name'].str.replace('[^A-Za-z0-9]', ' ').str.replace('  ', ' ').str.replace('   ', ' ').str.lower().str.strip()

Creazione df con nomi unici delle università sui tre dataset ranking

In [13]:
times_unique_df = pd.DataFrame(times['university_name'].unique(),columns=['university_name'])
shanghai_unique_df = pd.DataFrame(shanghai['university_name'].unique(),columns=['university_name'])
cwur_unique_df = pd.DataFrame(cwur['university_name'].unique(),columns=['university_name'])
List = [times_unique_df,shanghai_unique_df, cwur_unique_df]  # Lista dei df 
df = pd.concat(List)
univ_unique = pd.DataFrame(df['university_name'].unique(),columns=['university_name'])

In [14]:
univ_unique

                                        university_name
0                                    harvard university
1                    california institute of technology
2                 massachusetts institute of technology
3                                   stanford university
4                                  princeton university
...                                                 ...
1414  ulsan national institute of science and techno...
1415                                shenzhen university
1416                         tianjin medical university
1417                            henan normal university
1418                      southwest jiaotong university

[1419 rows x 1 columns]

Costruzione doc-term matrix

In [15]:
cv = CountVectorizer() 
count_matrix = cv.fit_transform(univ_unique['university_name'])

In [16]:
count_matrix.shape

(1419, 1375)

In [17]:
doc_term_matrix = count_matrix.todense()
df_matrix = pd.DataFrame(doc_term_matrix, 
                  columns=cv.get_feature_names(), 
                  index=univ_unique['university_name'])
df_matrix

,11,13,aachen,aalborg,aalto,aarhus,abc,abdulaziz,abdullah,aberdeen,...,york,young,yuan,yvelines,zagreb,zaragoza,ze,zhejiang,zhengzhou,zurich
university_name,,,,,,,,,,,,,,,,,,,,,
harvard university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
california institute of technology,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
massachusetts institute of technology,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
stanford university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
princeton university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
ulsan national institute of science and technology,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
shenzhen university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
tianjin medical university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
henan normal university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
southwest jiaotong university,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

Calcolo della misura di similarità tra i nomi delle università

In [18]:
cosine_sim = cosine_similarity(count_matrix)

In [19]:
df_cosine_sim= pd.DataFrame(cosine_sim, columns=univ_unique['university_name'], index= univ_unique['university_name'])

In [20]:
df_cosine_sim

university_name,harvard university,california institute of technology,massachusetts institute of technology,stanford university,princeton university,university of cambridge,university of oxford,university of california berkeley,imperial college london,yale university,...,hefei university of technology,university of lethbridge,shahid beheshti university of medical sciences,gachon university,harbin engineering university,ulsan national institute of science and technology,shenzhen university,tianjin medical university,henan normal university,southwest jiaotong university
university_name,,,,,,,,,,,,,,,,,,,,,
harvard university,1.000000,0.000000,0.000000,0.500000,0.500000,0.408248,0.408248,0.353553,0.0,0.500000,...,0.353553,0.408248,0.288675,0.500000,0.408248,0.000000,0.500000,0.408248,0.408248,0.408248
california institute of technology,0.000000,1.000000,0.750000,0.000000,0.000000,0.288675,0.288675,0.500000,0.0,0.000000,...,0.500000,0.288675,0.204124,0.000000,0.000000,0.566947,0.000000,0.000000,0.000000,0.000000
massachusetts institute of technology,0.000000,0.750000,1.000000,0.000000,0.000000,0.288675,0.288675,0.250000,0.0,0.000000,...,0.500000,0.288675,0.204124,0.000000,0.000000,0.566947,0.000000,0.000000,0.000000,0.000000
stanford university,0.500000,0.000000,0.000000,1.000000,0.500000,0.408248,0.408248,0.353553,0.0,0.500000,...,0.353553,0.408248,0.288675,0.500000,0.408248,0.000000,0.500000,0.408248,0.408248,0.408248
princeton university,0.500000,0.000000,0.000000,0.500000,1.000000,0.408248,0.408248,0.353553,0.0,0.500000,...,0.353553,0.408248,0.288675,0.500000,0.408248,0.000000,0.500000,0.408248,0.408248,0.408248
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
ulsan national institute of science and technology,0.000000,0.566947,0.566947,0.000000,0.000000,0.218218,0.218218,0.188982,0.0,0.000000,...,0.377964,0.218218,0.154303,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
shenzhen university,0.500000,0.000000,0.000000,0.500000,0.500000,0.408248,0.408248,0.353553,0.0,0.500000,...,0.353553,0.408248,0.288675,0.500000,0.408248,0.000000,1.000000,0.408248,0.408248,0.408248
tianjin medical university,0.408248,0.000000,0.000000,0.408248,0.408248,0.333333,0.333333,0.288675,0.0,0.408248,...,0.288675,0.333333,0.471405,0.408248,0.333333,0.000000,0.408248,1.000000,0.333333,0.333333
henan normal university,0.408248,0.000000,0.000000,0.408248,0.408248,0.333333,0.333333,0.288675,0.0,0.408248,...,0.288675,0.333333,0.235702,0.408248,0.333333,0.000000,0.408248,0.333333,1.000000,0.333333
southwest jiaotong university,0.408248,0.000000,0.000000,0.408248,0.408248,0.333333,0.333333,0.288675,0.0,0.408248,...,0.288675,0.333333,0.235702,0.408248,0.333333,0.000000,0.408248,0.333333,0.333333,1.000000

Selezione delle università con nomi aventi una similarità elevata (compresa tra 0.85 e 0.99, con esclusione dei match diretti)

In [21]:
df_similar_uni=pd.DataFrame(df_cosine_sim.where(np.triu((df_cosine_sim.values >= 0.85) & (df_cosine_sim.values <= 0.99))).stack().sort_values(ascending=False))
df_similar_uni.rename(columns={0: 'cosine_sim'}, inplace=True)
df_similar_uni.index.set_names(["uni1", "uni2"], inplace=True)
df_similar_uni.reset_index(inplace=True)
pd.set_option('display.max_rows', 300)
df_similar_uni=df_similar_uni.sort_values('cosine_sim', ascending=False).drop_duplicates('uni1').sort_index()
df_similar_uni

,uni1,uni2,cosine_sim
0,state university of new york at albany,university at albany state university of new york,0.956183
1,university of medicine and dentistry of new je...,university of medicine and dentistry new jersey,0.956183
2,swiss federal institute of technology of lausanne,swiss federal institute of technology lausanne,0.952579
3,university of science and technology of china,university of electronic science and technolog...,0.948683
4,the university of texas health science center ...,university of texas health science center at s...,0.948683
5,paris dauphine university,paris dauphine university paris 9,0.942809
6,the university of texas health science center ...,university of texas health science center at h...,0.942809
7,indiana university purdue university at indian...,indiana university purdue university indianapolis,0.935414
8,the university of texas medical branch at galv...,university of texas medical branch at galveston,0.935414
9,hong kong university of science and technology,the hong kong university of science and techno...,0.935414
10,rutgers the state university of new jersey,rutgers the state university of new jersey ne...,0.935414
11,korea advanced institute of science and techno...,korea advanced institute of science and techno...,0.935414
12,norwegian university of science and technology,norwegian university of science and technology...,0.925820
13,state university of new york albany,state university of new york at albany,0.925820
14,paris diderot university paris 7,university of paris diderot paris 7,0.925820
15,london school of hygiene and tropical medicine,london school of hygiene tropical medicine,0.925820
16,university of paris dauphine paris 9,paris dauphine university paris 9,0.925820
17,university of paris diderot paris 7,university paris diderot paris 7,0.925820
18,university of texas at san antonio,the university of texas at san antonio,0.925820
19,swiss federal institute of technology lausanne,swiss federal institute of technology in lausanne,0.925820
20,king fahd university of petroleum and minerals,king fahd university of petroleum minerals,0.925820
21,swiss federal institute of technology zurich,swiss federal institute of technology in zurich,0.925820
22,university of massachusetts medical school wo...,university of massachusetts medical school,0.912871
23,chinese university of hong kong,the chinese university of hong kong,0.912871
24,university of texas at austin,the university of texas at austin,0.912871
25,the chinese university of hong kong,the university of hong kong,0.912871
26,university of rome ii tor vergata,university of rome tor vergata,0.912871
27,the university of alabama at birmingham,university of alabama at birmingham,0.912871
28,university of new south wales,the university of new south wales,0.912871
29,the college of william and mary,college of william and mary,0.912871
30,the graduate university for advanced studies,graduate university for advanced studies,0.912871
31,university of texas at dallas,the university of texas at dallas,0.912871
32,tokyo medical and dental university tmdu,tokyo medical and dental university,0.912871
33,rio de janeiro state university uerj,rio de janeiro state university,0.912871
34,otto von guericke university of magdeburg,otto von guericke university magdeburg,0.912871
35,lille 2 university health and law,lille 2 university of health and law,0.912871
36,pierre and marie curie university,pierre and marie curie university paris 6,0.912871
37,state university of new york at buffalo,university at buffalo the state university of ...,0.911685
39,national taiwan university of science and tech...,national taiwan university of science and tech...,0.911685
40,university of western ontario,western university the university of western o...,0.904534
41,eth zurich swiss federal institute of technol...,swiss federal institute of technology zurich,0.903696
43,university of maryland baltimore county,university of maryland baltimore,0.894427
44,beijing university of chemical technology,beijing university of technology,0.894427
45,university of south florida,university of south florida tampa,0.894427
46,pontifical catholic university of chile,catholic university of chile,0.894427
47,medical university of south carolina,university of south carolina,0.894427
48,north carolina state university,north carolina state university raleigh,0.894427
49,cole normale sup rieure,cole normale sup rieure paris,0.894427
51,scuola normale superiore di pisa,scuola normale superiore pisa,0.894427
52,university of hong kong,chinese university of hong kong,0.894427
53,oregon health and science university,oregon health science university,0.894427
55,university of colorado boulder,university of colorado at boulder,0.894427
56,university of western australia,the university of western australia,0.894427
57,royal holloway university of london,royal holloway u of london,0.894427
58,queen mary university of london,queen mary u of london,0.894427
59,hong kong polytechnic university,the hong kong polytechnic university,0.894427
60,national sun yat sen university,sun yat sen university,0.894427
61,karlsruhe institute of technology,karlsruhe institute of technology kit,0.894427
62,universit libre de bruxelles,universit libre de bruxelles ulb,0.894427
63,kth royal institute of technology,royal institute of technology,0.894427
64,hebrew university of jerusalem,the hebrew university of jerusalem,0.894427
65,university of south carolina,university of south carolina columbia,0.894427
66,university of san francisco,university of california san francisco,0.894427
67,university of wroc aw,wroc aw university of technology,0.894427
68,massachusetts institute of technology,massachusetts institute of technology mit,0.894427
69,university of santiago de compostela,university of santiago compostela,0.894427
70,university of new hampshire durham,university of new hampshire,0.894427
71,federal university of sao paulo,federal university of s o paulo,0.894427
72,university of sao paulo,federal university of sao paulo,0.894427
73,the ohio state university columbus,ohio state university columbus,0.894427
74,university of oklahoma norman,university of oklahoma norman campus,0.894427
75,paul sabatier university toulouse 3,paul sabatier university toulouse iii,0.894427
76,university of colorado at denver,university of colorado denver,0.894427
77,federal university of paran ufpr,federal university of paran,0.894427
78,university of new england,university of new england australia,0.894427
79,university of arkansas at fayetteville,university of arkansas fayetteville,0.894427
80,the university of montana missoula,university of montana missoula,0.894427
81,city university of new york city college,city college of new york,0.894427
82,university of paris north paris 13,university of paris 13,0.883883
83,university of paris sud paris 11,university of paris sud,0.883883
89,pennsylvania state university,pennsylvania state university university park,0.872872
90,university of pittsburgh,university of pittsburgh pittsburgh campus,0.872872
92,paris descartes university,university of paris descartes paris 5,0.872872
93,university of sheffield,the university of sheffield,0.866025
94,university of glasgow,the university of glasgow,0.866025
95,university of innsbruck,medical university of innsbruck,0.866025
96,the university of tokushima,university of tokushima,0.866025
98,national taiwan university,national taiwan normal university,0.866025
99,the university of akron,university of akron,0.866025
100,pompeu fabra university,university of pompeu fabra,0.866025
101,arizona state university,arizona state university tempe,0.866025
102,medical university of innsbruck,innsbruck medical university,0.866025
103,university of victoria,victoria university of wellington,0.866025
105,university of auckland,auckland university of technology,0.866025
106,university of barcelona,autonomous university of barcelona,0.866025
107,university of dundee,the university of dundee,0.866025
108,university of maine,university of maine orono,0.866025
109,the university of memphis,university of memphis,0.866025
110,university of arkansas,university of arkansas fayetteville,0.866025
111,technical university of munich,technical university munich,0.866025
113,johns hopkins university,the johns hopkins university,0.866025
114,university of bordeaux ii,university of bordeaux i,0.866025
115,university of colorado denver,university of denver,0.866025
116,china medical university,china medical university prc,0.866025
117,university of washington,university of washington seattle,0.866025
118,university of tokyo,tokyo university of science,0.866025
120,university of melbourne,the university of melbourne,0.866025
121,university of edinburgh,the university of edinburgh,0.866025
122,suny at albany,university at albany suny,0.866025
123,australian national university,the australian national university,0.866025
127,university of wisconsin,university of wisconsin milwaukee,0.866025
129,university of massachusetts,university of massachusetts lowell,0.866025
131,ohio state university,ohio state university columbus,0.866025
132,university of sydney,university of technology sydney,0.866025
134,university of adelaide,the university of adelaide,0.866025
136,university of manchester,the university of manchester,0.866025
137,george washington university,the george washington university,0.866025
138,the university of queensland,university of queensland,0.866025
140,university of vienna,medical university of vienna,0.866025
141,university of kansas,university of kansas lawrence,0.866025
142,university of lincoln,university of nebraska lincoln,0.866025
143,university of tampere,tampere university of technology,0.866025
144,university of valencia,polytechnic university of valencia,0.866025
145,university of warsaw,warsaw university of technology,0.866025
146,vrije universiteit brussel,vrije universiteit brussel vub,0.866025
148,washington state university,washington state university pullman,0.866025
149,leibniz university of hanover,university of hanover,0.866025
150,new university of lisbon,university of lisbon,0.866025
151,polytechnic university of turin,university of turin,0.866025
152,paris sud university,university of paris sud,0.866025
153,joseph fourier university,joseph fourier university grenoble 1,0.866025
154,university of montana,university of montana missoula,0.866025
155,palack university in olomouc,palack university olomouc,0.866025
156,oklahoma state university,oklahoma state university stillwater,0.866025
157,university of nebraska lincoln,university of lincoln,0.866025
158,china medical university taiwan,china medical university,0.866025
159,university of rovira i virgili,rovira i virgili university,0.866025
160,montana state university,montana state university bozeman,0.866025
161,western sydney university,university of western sydney,0.866025
162,china agricultural university,south china agricultural university,0.866025
163,university of bordeaux,university of bordeaux ii,0.866025
164,technical university of dortmund,university of dortmund,0.866025
165,university of chile,catholic university of chile,0.866025
166,university of kaiserslautern,kaiserslautern university of technology,0.866025
167,university of southern queensland,university of queensland,0.866025
168,university of southern mississippi,university of mississippi,0.866025
169,texas tech university,texas tech university ttu,0.866025
171,university of florida,university of south florida,0.866025
173,university of bordeaux 1,university of bordeaux ii,0.866025
174,university of reading,the university of reading,0.866025
176,university of s o paulo,federal university of s o paulo,0.866025
177,university of georgia,the university of georgia,0.866025
179,university of milan,polytechnic university of milan,0.866025
180,university of calgary,the university of calgary,0.866025
182,university of graz,medical university of graz,0.866025
183,technical university of darmstadt,technical university darmstadt,0.866025
184,state university of campinas,university of campinas,0.866025
185,queensland university of technology,university of queensland,0.866025
186,lomonosov moscow state university,moscow state university,0.866025
187,university of missouri,university of missouri columbia,0.866025
188,university of oklahoma,university of oklahoma norman,0.866025
190,university at buffalo the state university of ...,university at albany state university of new york,0.858116
191,university of paris descartes paris 5,university of paris dauphine paris 9,0.857143
193,the university of texas m d anderson cancer ce...,university of texas md anderson cancer center,0.857143
195,swiss federal institute of technology in zurich,swiss federal institute of technology in lausanne,0.857143
196,national university of science and technology ...,national taiwan university of science and tech...,0.857143
198,rutgers the state university of new jersey ne...,rutgers the state university of new jersey ne...,0.852803
199,western university,western university the university of western o...,0.852803

Costruzione dizionario per i risultati contenuti nel df mostrato al punto precedente

In [22]:
univ_sim_dict = dict(zip(df_similar_uni.uni1, df_similar_uni.uni2))

Prima della modifica il ds times aveva 818 nomi unici di università

In [23]:
times["university_name"].nunique()

818

Replacement dei nomi delle università contenuti nei tre dataset dei ranking con quelli che trovano un match nel dizionario costruito al punto precedente. Se non esiste alcun match, allora non viene modificato il nome dell'univeristà

In [24]:
times["university_name"].replace(univ_sim_dict, inplace=True)
shanghai["university_name"].replace(univ_sim_dict, inplace=True)
cwur["university_name"].replace(univ_sim_dict, inplace=True)

Dopo la sostituzione il ds times contiene 799 nomi unici di università

In [25]:
times["university_name"].nunique()

799

# **1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes**

In [26]:
times.year.describe()

count    2603.000000
mean     2014.075682
std         1.685733
min      2011.000000
25%      2013.000000
50%      2014.000000
75%      2016.000000
max      2016.000000
Name: year, dtype: float64

In [27]:
times_most_recent = times.loc[times.groupby('university_name')['year'].idxmax()]
times_most_recent.head(3)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2003,201-250,aalborg university,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,aalto university,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,aarhus university,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016

In [28]:
len(times_most_recent)

799

In [29]:
times_least_recent = times.loc[times.groupby('university_name')['year'].idxmin()]
times_least_recent.head(3)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
501,301-350,aalborg university,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,aalto university,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,aarhus university,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011

In [30]:
len(times_least_recent)

799

# **2. For each university, compute the improvement in income between the least recent and the most recent data points**

Check dei missing sul campo income

In [31]:
times.groupby('income').size()

income
-        218
100.0     68
24.2       5
24.5       2
24.6       1
        ...
99.5       5
99.6       2
99.7       4
99.8      10
99.9      14
Length: 613, dtype: int64

Replacement di - con 00.00 e conversione del campo income in float

In [32]:
times_most_recent['income'].replace('-', '00.00', inplace=True)
times_least_recent['income'].replace('-', '00.00', inplace=True)

In [33]:
times_most_recent['income'] = times_most_recent['income'].astype(float)
times_least_recent['income'] = times_least_recent['income'].astype(float)

Merge dei df most recent e least recent

In [34]:
merged_least_most=pd.merge(
            times_least_recent[['university_name', 'income', 'year']],
            times_most_recent[['university_name', 'income', 'year']],
                        on='university_name', suffixes=('_least_recent', '_most_recent')
            )
merged_least_most['income_diff']=merged_least_most['income_most_recent']-merged_least_most['income_least_recent']

Vengono eliminate quelle università per cui non può essere calcolata la differenza della variabile 'income' in quanto hanno 'income_least_recent' o 'income_most_recent' nullo.

In [35]:
merged_least_most = merged_least_most[(merged_least_most['income_least_recent'] != 0.0) & (merged_least_most['income_most_recent'] != 0.0)]

In [36]:
merged_least_most.dropna(subset=['income_least_recent','income_most_recent'], inplace=True)

In [37]:
merged_least_most.sort_values(by='university_name')

,university_name,income_least_recent,year_least_recent,income_most_recent,year_most_recent,income_diff
0,aalborg university,36.4,2012,43.7,2016,7.3
1,aalto university,61.9,2012,61.6,2016,-0.3
2,aarhus university,61.5,2011,68.3,2016,6.8
3,aberystwyth university,35.5,2012,31.3,2016,-4.2
4,adam mickiewicz university,28.7,2016,28.7,2016,0.0
...,...,...,...,...,...,...
794,yokohama national university,40.4,2016,40.4,2016,0.0
795,yonsei university,40.4,2011,75.9,2016,35.5
796,york university,41.7,2012,33.2,2016,-8.5
797,yuan ze university,29.2,2012,39.8,2016,10.6
798,zhejiang university,70.3,2011,96.2,2016,25.9

# **3. Find the university with the largest increase computed in the previous point**

In [38]:
univ_max_impr = merged_least_most.income_diff.idxmax()

In [39]:
merged_least_most[merged_least_most.index == univ_max_impr]

,university_name,income_least_recent,year_least_recent,income_most_recent,year_most_recent,income_diff
476,tu dresden,31.9,2012,99.7,2016,67.8

# **4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range**

I ranking sono presenti nei ds di times, cwur e shanghai

In [40]:
shanghai.year.describe()

count    4896.000000
mean     2009.657884
std         3.197546
min      2005.000000
25%      2007.000000
50%      2009.000000
75%      2012.000000
max      2015.000000
Name: year, dtype: float64

world_rank espresso in range nel ds shanghai e total score non valorizzato

In [41]:
shanghai[shanghai['world_rank'].str.contains("-")]

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
100,101-152,aarhus university,2,NaN,15.4,19.3,7.9,22.3,41.6,22.4,2005
101,101-152,arizona state university tempe,54-71,NaN,0.0,14.4,20.8,26.3,41.9,17.5,2005
102,101-152,baylor college of medicine,54-71,NaN,0.0,0.0,17.6,34.5,44.0,24.9,2005
103,101-152,catholic university of leuven,1-4,NaN,0.0,0.0,19.2,16.0,48.7,23.1,2005
104,101-152,catholic university of louvain,1-4,NaN,14.0,13.9,13.6,8.3,44.7,26.9,2005
...,...,...,...,...,...,...,...,...,...,...,...
4891,401-500,university of trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015
4892,401-500,university of zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015
4893,401-500,utah state university,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015
4894,401-500,vienna university of technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015
4895,401-500,wake forest university,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015

In [42]:
shanghai = shanghai.fillna(0)

Estrazione dei ranking più recenti per i ds shanghai e cwur. Per il ds times è già stato creato il df most_recent al punto 2

In [43]:
shanghai_most_recent=shanghai.loc[shanghai.groupby('university_name')['year'].idxmax()]
cwur_most_recent=cwur.loc[cwur.groupby('university_name')['year'].idxmax()]

Nella colonna 'world_rank' del dataset 'times' alcuni valori contengono il carattere stringa '=' che precede il valore indicativo del ranking. Viene quindi eliminato il carattere stringa '=' qualora sia presente nei dati.

In [44]:
def rank(df):
    df['world_rank']=df['world_rank'].str.replace('=','')
    df['world_rank_min']=df['world_rank'].str.extract(r'(^\d+)').astype(int)
    df['world_rank_max']=df['world_rank'].str.extract(r'(\d+$)').astype(int)
    df['world_rank_avg']=(df['world_rank_min']+df['world_rank_max'])/2
    return df

In [45]:
rank(times_most_recent)
rank(shanghai_most_recent)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_min,world_rank_max,world_rank_avg
4696,301-400,aalborg university,5,0.0,0.0,0.0,11.2,4.6,30.4,16.8,2015,301,400,350.5
4796,401-500,aalto university,4-6,0.0,0.0,0.0,0.0,10.4,33.4,17.0,2015,401,500,450.5
4468,73,aarhus university,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73,73,73.0
4496,101-150,aix marseille university,5-6,0.0,13.6,0.0,15.2,20.3,50.1,27.6,2015,101,150,125.5
4797,401-500,aristotle university of thessaloniki,2,0.0,0.0,0.0,4.9,1.5,34.0,16.8,2015,401,500,450.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3512,401-500,yamaguchi university,17-23,0.0,0.0,0.0,16.1,2.8,20.0,13.2,2011,401,500,450.5
4694,201-300,yeshiva university,79-102,0.0,0.0,0.0,6.3,21.7,31.5,21.6,2015,201,300,250.5
4695,201-300,yonsei university,2-5,0.0,0.0,0.0,8.6,4.9,52.1,21.4,2015,201,300,250.5
4395,401-500,york university,19-21,0.0,0.0,0.0,0.0,10.1,30.6,12.4,2014,401,500,450.5
4545,101-150,zhejiang university,1-4,0.0,0.0,0.0,7.1,13.5,68.5,19.9,2015,101,150,125.5

In [46]:
cwur_most_recent['world_rank_avg']=cwur_most_recent['world_rank']

In [47]:
total_most_recent=pd.concat([
                            times_most_recent, 
                            shanghai_most_recent, 
                            cwur_most_recent
                            ],sort=False)

In [48]:
total_most_recent.reset_index(drop=True, inplace=True)

In [49]:
total_min=total_most_recent.loc[total_most_recent.groupby('university_name')['world_rank_avg'].idxmin()][['university_name', 'world_rank_avg']]
total_min.rename(columns=({'world_rank_avg':'min'}), inplace=True)
total_max=total_most_recent.loc[total_most_recent.groupby('university_name')['world_rank_avg'].idxmax()][['university_name', 'world_rank_avg']]
total_max.rename(columns=({'world_rank_avg':'max'}), inplace=True)

In [50]:
df4=pd.merge(total_min, total_max, on='university_name')
df4['diff']=df4['max']-df4['min']
df4.head()

              university_name    min    max   diff
0          aalborg university  225.5  565.0  339.5
1            aalto university  275.5  450.5  175.0
2           aarhus university   73.0  122.0   49.0
3      aberystwyth university  325.5  814.0  488.5
4  adam mickiewicz university  700.5  700.5    0.0

Si verifica che l'esempio di differenza massima tra i rank fornito dal professore sia verificato.

In [51]:
df4[df4['university_name']=='aarhus university']

     university_name   min    max  diff
2  aarhus university  73.0  122.0  49.0

**Procedimento alternativo con il ricacolo dello score per times e shanghai**

In [52]:
shanghai['total_score'] = shanghai['total_score'].astype(float)

http://www.shanghairanking.com/ARWU-Methodology-2016.html --> metodologia per il calcolo dello score
aggiungo una colonna al df con i nuovi punteggi grezzi non ancora aggiustati rispetto al punteggio max per ciascun anno (il primo in classifica vale 100, gli altri punteggi vengono aggiustati in funzione di questo)

In [53]:
shanghai['new_total_score'] = (shanghai['alumni']*10/100+shanghai['award']*20/100+shanghai['hici']*20/100+
                               shanghai['ns']*20/100+shanghai['pub']*20/100+shanghai['pcp']*10/100)

In [54]:
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score
0,1,harvard university,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,97.24
1,2,university of cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005,71.51
2,3,stanford university,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005,71.39
3,4,university of california berkeley,3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005,70.75
4,5,massachusetts institute of technology mit,4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005,68.18

Estrazione punteggi max per ciascun anno e creazione di un dizionario con il peso per ciascuno score max relativo ad ogni anno

In [55]:
top_scores_year = shanghai.groupby('year')['new_total_score'].max().reset_index()
top_scores_year['weight'] = 100/top_scores_year['new_total_score']
top_scores_year_dict = pd.Series(top_scores_year.weight.values,index=top_scores_year.year).to_dict()
top_scores_year_dict

{2005: 1.0283833813245578,
 2006: 1.0271158586688578,
 2007: 1.027749229188078,
 2008: 1.026588645929576,
 2009: 1.0258514567090684,
 2010: 1.031778786628147,
 2011: 1.0303967027305514,
 2012: 1.0297600659046442,
 2013: 1.0282776349614395,
 2014: 1.0253255408592228,
 2015: 1.0239606799098915}

Aggiunta della colonna contente il peso nel ds di shanghai

In [56]:
shanghai['weight_new_total_score'] = shanghai['year'].map(top_scores_year_dict)

shanghai[shanghai['university_name'] == 'aarhus university']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score,weight_new_total_score
100,101-152,aarhus university,2,0.0,15.4,19.3,7.9,22.3,41.6,22.4,2005,22.00,1.028383
601,102-150,aarhus university,2,0.0,14.8,18.9,7.7,23.8,42.7,24.6,2006,22.56,1.027116
1101,102-150,aarhus university,2,0.0,14.4,18.9,7.4,24.3,40.8,23.7,2007,22.09,1.027749
1603,93,aarhus university,2,24.5,13.7,18.9,7.3,24.5,48.2,27.0,2008,23.85,1.026589
2109,97,aarhus university,2,24.2,13.4,18.9,7.3,24.0,47.6,26.6,2009,23.56,1.025851
2611,98,aarhus university,2,24.2,13.1,18.9,7.2,23.5,48.4,25.4,2010,23.45,1.031779
3099,86,aarhus university,2,25.4,13.2,22.1,7.2,24.3,49.3,27.9,2011,24.69,1.030397
3599,86,aarhus university,2,25.5,12.1,22.8,7.2,23.9,50.8,26.6,2012,24.81,1.029760
3878,81,aarhus university,2.0,26.0,12.0,22.2,7.2,25.6,50.9,28.5,2013,25.23,1.028278
3969,74,aarhus university,2,27.4,11.8,22.1,12.3,26.7,51.9,29.8,2014,26.76,1.025326
4468,73,aarhus university,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,26.65,1.023961

Score aggiustato per il peso

In [57]:
shanghai['new_total_score'] = (shanghai['new_total_score']*shanghai['weight_new_total_score']).round(1)

In [58]:
shanghai

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score,weight_new_total_score
0,1,harvard university,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,100.0,1.028383
1,2,university of cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005,73.5,1.028383
2,3,stanford university,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005,73.4,1.028383
3,4,university of california berkeley,3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005,72.8,1.028383
4,5,massachusetts institute of technology mit,4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005,70.1,1.028383
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4891,401-500,university of trieste,11-20,0.0,0.0,0.0,5.0,10.9,25.1,20.1,2015,10.5,1.023961
4892,401-500,university of zaragoza,9-13,0.0,0.0,0.0,7.6,5.1,33.3,13.1,2015,10.8,1.023961
4893,401-500,utah state university,126-146,0.0,13.6,0.0,3.6,10.8,25.1,15.5,2015,11.1,1.023961
4894,401-500,vienna university of technology,4-6,0.0,0.0,0.0,0.0,12.2,28.8,22.9,2015,10.7,1.023961
4895,401-500,wake forest university,126-146,0.0,0.0,0.0,14.9,7.5,25.0,11.9,2015,10.9,1.023961

In [59]:
shanghai = shanghai.groupby('year').apply(lambda x: x.sort_values('new_total_score', ascending= False )).reset_index(drop=True)
shanghai

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score,weight_new_total_score
0,1,harvard university,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,100.0,1.028383
1,2,university of cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005,73.5,1.028383
2,3,stanford university,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005,73.4,1.028383
3,4,university of california berkeley,3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005,72.8,1.028383
4,5,massachusetts institute of technology mit,4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005,70.1,1.028383
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4891,401-500,okayama university,13-18,0.0,0.0,0.0,3.6,9.0,28.3,11.7,2015,9.6,1.023961
4892,401-500,university of tokushima,13-18,0.0,13.6,0.0,5.1,8.0,19.7,14.7,2015,9.6,1.023961
4893,401-500,university of rennes 1,19-22,0.0,0.0,0.0,3.6,9.2,28.1,11.2,2015,9.5,1.023961
4894,401-500,nara institute of science and technology,13-18,0.0,0.0,0.0,13.3,13.5,13.9,11.4,2015,9.5,1.023961
4895,401-500,stockholm school of economics,11,0.0,0.0,16.3,0.0,0.0,10.2,39.4,2015,9.5,1.023961

Siccome nei records in cui sono presenti i world_rank non espressi in range sono presenti dei ranking ripetuti quando i total scores delle università sono uguali, creo un sottoindice per ciascun anno per tenere l'ordinamento originale ed assegno lo stesso posto in classifica se il punteggio del new_total_score è uguale per due università

In [60]:
shanghai['group_index_sha'] = shanghai.groupby('year').cumcount() + 1

In [61]:
shanghai['new_world_ranking_sha'] = shanghai['group_index_sha']

Per la creazione del nuovo ranking utilizziamo il new_total_rank

In [62]:
for i in range(1, len(shanghai)):

    if shanghai.new_total_score.loc[i-1] != shanghai.new_total_score.loc[i]:
        shanghai['new_world_ranking_sha'].loc[i] = shanghai['group_index_sha'].loc[i]
        
    else:
        shanghai['new_world_ranking_sha'].loc[i] = shanghai.new_world_ranking_sha.loc[i-1]
    i = i+1

In [63]:
shanghai

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score,weight_new_total_score,group_index_sha,new_world_ranking_sha
0,1,harvard university,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,100.0,1.028383,1,1
1,2,university of cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005,73.5,1.028383,2,2
2,3,stanford university,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005,73.4,1.028383,3,3
3,4,university of california berkeley,3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005,72.8,1.028383,4,4
4,5,massachusetts institute of technology mit,4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005,70.1,1.028383,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4891,401-500,okayama university,13-18,0.0,0.0,0.0,3.6,9.0,28.3,11.7,2015,9.6,1.023961,496,492
4892,401-500,university of tokushima,13-18,0.0,13.6,0.0,5.1,8.0,19.7,14.7,2015,9.6,1.023961,497,492
4893,401-500,university of rennes 1,19-22,0.0,0.0,0.0,3.6,9.2,28.1,11.2,2015,9.5,1.023961,498,498
4894,401-500,nara institute of science and technology,13-18,0.0,0.0,0.0,13.3,13.5,13.9,11.4,2015,9.5,1.023961,499,498
4895,401-500,stockholm school of economics,11,0.0,0.0,16.3,0.0,0.0,10.2,39.4,2015,9.5,1.023961,500,498

Creazione del df con i dati più recenti per ciascuna università

In [64]:
shanghai_most_recent = shanghai.loc[shanghai.groupby('university_name')['year'].idxmax()].reset_index()

In [65]:
shanghai_most_recent

,index,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score,weight_new_total_score,group_index_sha,new_world_ranking_sha
0,4792,301-400,aalborg university,5,0.0,0.0,0.0,11.2,4.6,30.4,16.8,2015,11.2,1.023961,397,392
1,4819,401-500,aalto university,4-6,0.0,0.0,0.0,0.0,10.4,33.4,17.0,2015,10.7,1.023961,424,424
2,4468,73,aarhus university,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,27.3,1.023961,73,73
3,4527,101-150,aix marseille university,5-6,0.0,13.6,0.0,15.2,20.3,50.1,27.6,2015,21.7,1.023961,132,132
4,4868,401-500,aristotle university of thessaloniki,2,0.0,0.0,0.0,4.9,1.5,34.0,16.8,2015,10.0,1.023961,473,471
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
615,3489,401-500,yamaguchi university,17-23,0.0,0.0,0.0,16.1,2.8,20.0,13.2,2011,9.4,1.030397,476,474
616,4660,201-300,yeshiva university,79-102,0.0,0.0,0.0,6.3,21.7,31.5,21.6,2015,14.4,1.023961,265,263
617,4634,201-300,yonsei university,2-5,0.0,0.0,0.0,8.6,4.9,52.1,21.4,2015,15.6,1.023961,239,237
618,4389,401-500,york university,19-21,0.0,0.0,0.0,0.0,10.1,30.6,12.4,2014,9.6,1.025326,494,491
619,4542,101-150,zhejiang university,1-4,0.0,0.0,0.0,7.1,13.5,68.5,19.9,2015,20.3,1.023961,147,146

In [66]:
shanghai_most_recent.year.describe()

count     620.000000
mean     2013.945161
std         2.375880
min      2005.000000
25%      2015.000000
50%      2015.000000
75%      2015.000000
max      2015.000000
Name: year, dtype: float64

In [67]:
shanghai_most_recent = shanghai_most_recent.sort_values(by =['year','new_world_ranking_sha'], ascending=True).reset_index(drop=True)
shanghai_most_recent[shanghai_most_recent['university_name']== 'aarhus university']

,index,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,new_total_score,weight_new_total_score,group_index_sha,new_world_ranking_sha
203,4468,73,aarhus university,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,27.3,1.023961,73,73

Pulizia dei campi

In [68]:
times['income'].replace('-', '00.00', inplace=True)
times['international'].replace('-', '00.00', inplace=True)
times['world_rank'] = times['world_rank'].str.replace('=', '')
times['international_students'] = times['international_students'].str.replace('%', ' ')
times['income'] = times['income'].astype(float)
times['international'] = times['international'].astype(float)
times['international_students'] = times['international_students'].astype(float)

https://www.timeshighereducation.com/news/ranking-methodology-2016
La metodologia di calcolo del ranking è variata nel 2012
tuttavia, ci sono solo tre univ che hanno come dato più recente il 2011 quindi usare questo metodo consente di essere più precisi rispetto alla prima soluzione fornita con il calcolo del punto medio. 
Invece, non è consigliabile usare l'ordinamento dei ranking presente nel ds perchè per i ranking espressi in range l'ordine nel ds è alfabetico sul nome università
Come per il ds shanghai, se due univ hanno medesimo new total score, il new_world_rank è uguale

In [69]:
times['new_total_score'] = (times['teaching']*30/100+times['international']*7.5/100+times['research']*30/100+times['citations']*30/100+times['income']*2.5/100).round(1)

In [70]:
times = times.groupby('year').apply(lambda x: x.sort_values('new_total_score', ascending= False )).reset_index(drop=True)
times[times['year']==2012]

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,new_total_score
200,1,california institute of technology,United States of America,95.7,56.0,98.2,99.9,97.0,94.8,"2,243",6.9,27.0,33 : 67,2012,94.8
201,2,stanford university,United States of America,94.8,57.2,98.9,99.8,63.8,93.9,"15,596",7.8,22.0,42 : 58,2012,93.9
202,2,harvard university,United States of America,95.8,67.5,97.4,99.8,35.9,93.9,"20,152",8.9,25.0,NaN,2012,93.9
203,4,university of oxford,United Kingdom,89.5,91.9,96.6,97.9,62.1,93.6,"19,919",11.6,34.0,46 : 54,2012,93.6
204,5,princeton university,United States of America,91.5,49.6,99.1,100.0,81.0,92.9,"7,929",8.4,27.0,45 : 55,2012,92.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
597,350-400,tokyo university of agriculture and technology,Japan,26.5,18.0,15.8,21.7,41.5,-,"5,865",14.4,5.0,27 : 73,2012,21.6
598,350-400,hiroshima university,Japan,27.7,18.8,16.3,20.1,39.4,-,"14,686",8.2,5.0,36 : 64,2012,21.6
599,350-400,new jersey institute of technology,United States of America,17.1,41.3,14.5,26.4,37.5,-,"10,646",26.2,17.0,25 : 75,2012,21.4
600,350-400,michigan technological university,United States of America,21.2,32.3,13.8,24.8,41.9,-,NaN,NaN,NaN,NaN,2012,21.4
601,350-400,aston university,United Kingdom,16.2,84.5,19.9,11.7,26.8,-,NaN,NaN,NaN,NaN,2012,21.3

In [71]:
times['group_index_times'] = times.groupby('year').cumcount() + 1

In [72]:
times['new_world_ranking_times'] = times['group_index_times']

In [73]:
for i in range(1, len(times)):
                
    if times.new_total_score.loc[i-1] != times.new_total_score.loc[i]:
        times['new_world_ranking_times'].loc[i] = times['group_index_times'].loc[i]
        
    else:
        times['new_world_ranking_times'].loc[i] = times.new_world_ranking_times.loc[i-1]
    i = i+1

In [74]:
times

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times
0,1,harvard university,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25.0,NaN,2011,95.5,1,1
1,3,massachusetts institute of technology mit,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33.0,37 : 63,2011,95.1,2,2
2,2,california institute of technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27.0,33 : 67,2011,94.9,3,3
3,4,stanford university,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22.0,42 : 58,2011,92.5,4,4
4,5,princeton university,United States of America,90.9,70.3,95.4,99.9,0.0,94.2,"7,929",8.4,27.0,45 : 55,2011,91.1,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2598,601-800,southern federal university,Russian Federation,21.9,17.3,8.2,9.2,39.5,-,"27,556",9.0,3.0,56 : 44,2016,14.1,796,792
2599,601-800,v n karazin kharkiv national university,Ukraine,21.7,48.4,8.9,1.7,28.8,-,"14,410",9.7,22.0,53 : 47,2016,14.0,797,797
2600,601-800,federal university of bahia,Brazil,18.2,19.7,8.1,14.3,0.0,-,"39,861",17.9,1.0,47 : 53,2016,13.7,798,798
2601,601-800,university of bras lia,Brazil,21.9,24.1,7.4,10.4,0.0,-,"45,880",14.5,2.0,52 : 48,2016,13.7,799,798
2602,601-800,federal university of paran,Brazil,24.6,15.5,9.6,7.0,0.0,-,"21,850",11.2,1.0,NaN,2016,13.5,800,800

In [75]:
times[times['world_rank'] == '1']

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times
0,1,harvard university,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25.0,NaN,2011,95.5,1,1
200,1,california institute of technology,United States of America,95.7,56.0,98.2,99.9,97.0,94.8,"2,243",6.9,27.0,33 : 67,2012,94.8,1,1
602,1,california institute of technology,United States of America,96.3,59.8,99.4,99.7,95.6,95.5,"2,243",6.9,27.0,33 : 67,2013,95.5,1,1
1002,1,california institute of technology,United States of America,94.4,65.8,98.2,99.8,91.2,94.9,"2,243",6.9,27.0,33 : 67,2014,94.9,1,1
1402,1,california institute of technology,United States of America,92.2,67.0,98.1,99.7,89.1,94.3,"2,243",6.9,27.0,33 : 67,2015,94.3,1,1
1803,1,california institute of technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",6.9,27.0,33 : 67,2016,95.1,1,1

Creazione del df con i dati più recenti per ciascuna università

In [76]:
times_most_recent = times.loc[times.groupby('university_name')['year'].idxmax()].reset_index()

In [77]:
times_most_recent

,index,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times
0,2051,201-250,aalborg university,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15.0,48 : 52,2016,44.6,249,247
1,2059,251-300,aalto university,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17.0,32 : 68,2016,44.2,257,255
2,1908,106,aarhus university,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14.0,54 : 46,2016,57.7,106,106
3,2143,301-350,aberystwyth university,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18.0,48 : 52,2016,38.5,341,341
4,2555,601-800,adam mickiewicz university,Poland,20.0,25.7,11.0,15.3,28.7,-,"40,633",15.6,1.0,71 : 29,2016,16.5,753,753
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
794,2540,601-800,yokohama national university,Japan,20.1,23.3,16.0,13.5,40.4,-,"10,117",12.1,8.0,28 : 72,2016,17.6,738,737
795,2150,301-350,yonsei university,South Korea,37.2,41.5,34.1,39.4,75.9,-,"24,774",11.6,14.0,NaN,2016,38.2,348,347
796,2149,301-350,york university,Canada,30.2,58.2,30.8,49.1,33.2,-,"48,007",39.4,9.0,59 : 41,2016,38.2,347,347
797,2458,601-800,yuan ze university,Taiwan,16.2,17.7,18.3,28.6,39.8,-,"8,663",20.6,4.0,43 : 57,2016,21.3,656,653
798,2086,251-300,zhejiang university,China,44.3,19.6,46.0,36.1,96.2,-,"47,508",15.9,5.0,41 : 59,2016,41.8,284,284

In [78]:
cwur

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,harvard university,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,massachusetts institute of technology mit,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,stanford university,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,university of cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,california institute of technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2195,996,university of the algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,alexandria university,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,federal university of cear,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,university of a coru a,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,china pharmaceutical university,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [79]:
cwur.rename(columns={'world_rank':'world_rank_cwur'}, inplace=True)

In [80]:
cwur_most_recent = cwur.loc[cwur.groupby('university_name')['year'].idxmax()].reset_index()

In [81]:
merged_rankings = shanghai_most_recent.merge(cwur_most_recent,on=['university_name'], how = 'outer').merge(times_most_recent,on=['university_name'], how='outer')[['university_name','new_world_ranking_sha','new_world_ranking_times','world_rank_cwur']]

In [82]:
merged_rankings

,university_name,new_world_ranking_sha,new_world_ranking_times,world_rank_cwur
0,college of france,151.0,NaN,NaN
1,northern arizona university,457.0,NaN,766.0
2,loyola university chicago,475.0,NaN,437.0
3,memorial university of newfoundland,484.0,553.0,611.0
4,university of wroclaw,484.0,NaN,NaN
...,...,...,...,...
1265,verona university,NaN,358.0,NaN
1266,wageningen university and research center,NaN,47.0,NaN
1267,west university of timi oara,NaN,785.0,NaN
1268,william mary,NaN,244.0,NaN
1269,y ld z technical university,NaN,779.0,NaN

In [83]:
merged_rankings = merged_rankings.fillna(0.00)

In [84]:
merged_rankings_match = merged_rankings[((merged_rankings['new_world_ranking_times']!= 0) & (merged_rankings['world_rank_cwur']!= 0))|((merged_rankings['world_rank_cwur'] != 0)&(merged_rankings['new_world_ranking_sha']!= 0))| ((merged_rankings['new_world_ranking_times'] != 0)&(merged_rankings['new_world_ranking_sha']!= 0))]

merged_rankings_match

,university_name,new_world_ranking_sha,new_world_ranking_times,world_rank_cwur
1,northern arizona university,457.0,0.0,766.0
2,loyola university chicago,475.0,0.0,437.0
3,memorial university of newfoundland,484.0,553.0,611.0
5,hacettepe university,490.0,729.0,634.0
6,graduate university for advanced studies,498.0,0.0,524.0
...,...,...,...,...
1107,xidian university,0.0,777.0,991.0
1111,yeungnam university,0.0,701.0,770.0
1112,yokohama city university,0.0,617.0,513.0
1113,yokohama national university,0.0,737.0,518.0
1114,yuan ze university,0.0,653.0,979.0

In [85]:
merged_rankings_match['max_rank'] = merged_rankings_match[['new_world_ranking_sha','new_world_ranking_times','world_rank_cwur']].max(axis=1)

In [86]:
merged_rankings_match['min_rank'] = merged_rankings_match[merged_rankings_match[['new_world_ranking_sha','new_world_ranking_times','world_rank_cwur']] !=0].min(axis=1)

In [87]:
merged_rankings_match['diff_rank'] = merged_rankings_match['max_rank'] - merged_rankings_match['min_rank']

In [88]:
merged_rankings_match

,university_name,new_world_ranking_sha,new_world_ranking_times,world_rank_cwur,max_rank,min_rank,diff_rank
1,northern arizona university,457.0,0.0,766.0,766.0,457.0,309.0
2,loyola university chicago,475.0,0.0,437.0,475.0,437.0,38.0
3,memorial university of newfoundland,484.0,553.0,611.0,611.0,484.0,127.0
5,hacettepe university,490.0,729.0,634.0,729.0,490.0,239.0
6,graduate university for advanced studies,498.0,0.0,524.0,524.0,498.0,26.0
...,...,...,...,...,...,...,...
1107,xidian university,0.0,777.0,991.0,991.0,777.0,214.0
1111,yeungnam university,0.0,701.0,770.0,770.0,701.0,69.0
1112,yokohama city university,0.0,617.0,513.0,617.0,513.0,104.0
1113,yokohama national university,0.0,737.0,518.0,737.0,518.0,219.0
1114,yuan ze university,0.0,653.0,979.0,979.0,653.0,326.0

In [89]:
merged_rankings_match[merged_rankings_match['university_name']=='aarhus university']

,university_name,new_world_ranking_sha,new_world_ranking_times,world_rank_cwur,max_rank,min_rank,diff_rank
203,aarhus university,73.0,106.0,122.0,122.0,73.0,49.0

# **5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.**

In [90]:
times_most_recent

,index,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times
0,2051,201-250,aalborg university,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15.0,48 : 52,2016,44.6,249,247
1,2059,251-300,aalto university,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17.0,32 : 68,2016,44.2,257,255
2,1908,106,aarhus university,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14.0,54 : 46,2016,57.7,106,106
3,2143,301-350,aberystwyth university,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18.0,48 : 52,2016,38.5,341,341
4,2555,601-800,adam mickiewicz university,Poland,20.0,25.7,11.0,15.3,28.7,-,"40,633",15.6,1.0,71 : 29,2016,16.5,753,753
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
794,2540,601-800,yokohama national university,Japan,20.1,23.3,16.0,13.5,40.4,-,"10,117",12.1,8.0,28 : 72,2016,17.6,738,737
795,2150,301-350,yonsei university,South Korea,37.2,41.5,34.1,39.4,75.9,-,"24,774",11.6,14.0,NaN,2016,38.2,348,347
796,2149,301-350,york university,Canada,30.2,58.2,30.8,49.1,33.2,-,"48,007",39.4,9.0,59 : 41,2016,38.2,347,347
797,2458,601-800,yuan ze university,Taiwan,16.2,17.7,18.3,28.6,39.8,-,"8,663",20.6,4.0,43 : 57,2016,21.3,656,653
798,2086,251-300,zhejiang university,China,44.3,19.6,46.0,36.1,96.2,-,"47,508",15.9,5.0,41 : 59,2016,41.8,284,284

In [91]:
times_most_recent['fem_ratio'] = times_most_recent.female_male_ratio.str.extract(r'(.*):')
times_most_recent['male_ratio'] = times_most_recent.female_male_ratio.str.extract(r'.*:(.*)')

In [92]:
times_most_recent

,index,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times,fem_ratio,male_ratio
0,2051,201-250,aalborg university,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15.0,48 : 52,2016,44.6,249,247,48,52
1,2059,251-300,aalto university,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17.0,32 : 68,2016,44.2,257,255,32,68
2,1908,106,aarhus university,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14.0,54 : 46,2016,57.7,106,106,54,46
3,2143,301-350,aberystwyth university,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18.0,48 : 52,2016,38.5,341,341,48,52
4,2555,601-800,adam mickiewicz university,Poland,20.0,25.7,11.0,15.3,28.7,-,"40,633",15.6,1.0,71 : 29,2016,16.5,753,753,71,29
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
794,2540,601-800,yokohama national university,Japan,20.1,23.3,16.0,13.5,40.4,-,"10,117",12.1,8.0,28 : 72,2016,17.6,738,737,28,72
795,2150,301-350,yonsei university,South Korea,37.2,41.5,34.1,39.4,75.9,-,"24,774",11.6,14.0,NaN,2016,38.2,348,347,NaN,NaN
796,2149,301-350,york university,Canada,30.2,58.2,30.8,49.1,33.2,-,"48,007",39.4,9.0,59 : 41,2016,38.2,347,347,59,41
797,2458,601-800,yuan ze university,Taiwan,16.2,17.7,18.3,28.6,39.8,-,"8,663",20.6,4.0,43 : 57,2016,21.3,656,653,43,57
798,2086,251-300,zhejiang university,China,44.3,19.6,46.0,36.1,96.2,-,"47,508",15.9,5.0,41 : 59,2016,41.8,284,284,41,59

In [93]:
times_most_recent = times_most_recent[times_most_recent['male_ratio'].notna()]

In [94]:
times_most_recent.dtypes

index                        int64
world_rank                  object
university_name             object
country                     object
teaching                   float64
international              float64
research                   float64
citations                  float64
income                     float64
total_score                 object
num_students                object
student_staff_ratio        float64
international_students     float64
female_male_ratio           object
year                         int64
new_total_score            float64
group_index_times            int64
new_world_ranking_times      int64
fem_ratio                   object
male_ratio                  object
dtype: object

In [95]:
times_most_recent['fem_ratio'] = times_most_recent['fem_ratio'].astype(int)
times_most_recent['male_ratio'] = times_most_recent['male_ratio'].astype(int)

In [96]:
times_most_recent['num_students'] = times_most_recent['num_students'].str.replace(',', '')
times_most_recent['num_students'] =times_most_recent['num_students'].astype(int)

In [97]:
times_most_recent['num_female'] = ( times_most_recent['fem_ratio']*times_most_recent['num_students']/100).round(0).astype(int)
times_most_recent['num_male'] = (times_most_recent['male_ratio']*times_most_recent['num_students']/100).round(0).astype(int)

In [98]:
times_most_recent

,index,world_rank,university_name,country,teaching,international,research,citations,income,total_score,...,international_students,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times,fem_ratio,male_ratio,num_female,num_male
0,2051,201-250,aalborg university,Denmark,25.1,71.0,28.4,73.8,43.7,-,...,15.0,48 : 52,2016,44.6,249,247,48,52,8363,9059
1,2059,251-300,aalto university,Finland,31.1,65.4,32.8,62.1,61.6,-,...,17.0,32 : 68,2016,44.2,257,255,32,68,5152,10947
2,1908,106,aarhus university,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,...,14.0,54 : 46,2016,57.7,106,106,54,46,12903,10992
3,2143,301-350,aberystwyth university,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,...,18.0,48 : 52,2016,38.5,341,341,48,52,4441,4811
4,2555,601-800,adam mickiewicz university,Poland,20.0,25.7,11.0,15.3,28.7,-,...,1.0,71 : 29,2016,16.5,753,753,71,29,28849,11784
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
792,2503,601-800,yeungnam university,South Korea,18.6,24.3,10.9,26.5,35.4,-,...,3.0,48 : 52,2016,19.5,701,701,48,52,10540,11418
794,2540,601-800,yokohama national university,Japan,20.1,23.3,16.0,13.5,40.4,-,...,8.0,28 : 72,2016,17.6,738,737,28,72,2833,7284
796,2149,301-350,york university,Canada,30.2,58.2,30.8,49.1,33.2,-,...,9.0,59 : 41,2016,38.2,347,347,59,41,28324,19683
797,2458,601-800,yuan ze university,Taiwan,16.2,17.7,18.3,28.6,39.8,-,...,4.0,43 : 57,2016,21.3,656,653,43,57,3725,4938
798,2086,251-300,zhejiang university,China,44.3,19.6,46.0,36.1,96.2,-,...,5.0,41 : 59,2016,41.8,284,284,41,59,19478,28030

In [99]:
female_country = times_most_recent.groupby('country')['num_female'].sum()
male_country = times_most_recent.groupby('country')['num_male'].sum()
FM_Country = pd.merge(female_country, male_country, on=['country'])

In [100]:
FM_Country

                          num_female  num_male
country
Argentina                      67191     41182
Australia                     353141    288564
Austria                        64651     62400
Bangladesh                     21323     41393
Belarus                        20219      9084
Belgium                        92920     76741
Brazil                        247271    246980
Canada                        344440    279188
Chile                          24235     37509
China                         423287    570175
Colombia                       26376     28269
Cyprus                          4747      2133
Czech Republic                 97971     77900
Denmark                        62748     56607
Egypt                         178561    197628
Estonia                        12965     11365
Finland                        55709     44309
France                        365129    285359
Germany                       454631    463871
Ghana                          15282     21992
Greece                        108804     93208
Hong Kong                      42738     37533
Hungary                        45546     42219
Iceland                         9214      4746
India                          45992    109379
Indonesia                      22218     21347
Iran                           58881     80111
Israel                         44587     38836
Italy                         599471    443368
Japan                         148093    299508
Jordan                         37414     22849
Kenya                          29070     43606
Latvia                         10268      4832
Lebanon                         3924      3771
Lithuania                      12362      6657
Luxembourg                      2572      2572
Macau                           4942      3579
Malaysia                       99276     62551
Mexico                         75804     75927
Morocco                        25788     30272
Netherlands                   115448    110429
New Zealand                    50536     39298
Nigeria                        11811     14436
Norway                         21208     18194
Oman                            3544      3544
Pakistan                        9373     13123
Poland                        121706     69035
Portugal                       58061     57980
Qatar                           7091      2492
Republic of Ireland            46637     43479
Romania                        71891     36487
Russian Federation             98970    105202
Saudi Arabia                   20457     15432
Serbia                         58181     38787
Singapore                      27493     29127
Slovakia                       16359     20920
Slovenia                       29293     19528
South Africa                  202378    127820
South Korea                   132803    160880
Spain                         406094    343574
Sweden                         72958     59665
Switzerland                    58477     60499
Taiwan                        116683    159860
Thailand                      111675     98447
Turkey                        410518    228824
Uganda                         18670     18670
Ukraine                        17846     19250
United Arab Emirates            9516      4931
United Kingdom                711814    613028
United States of America     1601453   1556324

# **6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)**

In [101]:
times_most_recent['ratio_']= times_most_recent['fem_ratio']/times_most_recent['male_ratio']

In [102]:
times_most_recent = times_most_recent[times_most_recent['male_ratio']!=0]

In [103]:
media = times_most_recent['ratio_'].mean()

In [104]:
ratio_inf=times_most_recent[times_most_recent['ratio_']<times_most_recent['ratio_'].mean()]

In [105]:
media

1.0858126447033292

In [106]:
len(ratio_inf)

374

In [107]:
ratio_inf

,index,world_rank,university_name,country,teaching,international,research,citations,income,total_score,...,female_male_ratio,year,new_total_score,group_index_times,new_world_ranking_times,fem_ratio,male_ratio,num_female,num_male,ratio_
0,2051,201-250,aalborg university,Denmark,25.1,71.0,28.4,73.8,43.7,-,...,48 : 52,2016,44.6,249,247,48,52,8363,9059,0.923077
1,2059,251-300,aalto university,Finland,31.1,65.4,32.8,62.1,61.6,-,...,32 : 68,2016,44.2,257,255,32,68,5152,10947,0.470588
3,2143,301-350,aberystwyth university,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,...,48 : 52,2016,38.5,341,341,48,52,4441,4811,0.923077
7,2510,601-800,ajou university,South Korea,19.5,20.0,11.9,23.9,45.7,-,...,33 : 67,2016,19.2,708,706,33,67,4193,8513,0.492537
8,2561,601-800,alexandria university,Egypt,20.3,33.7,8.2,14.1,29.7,-,...,46 : 54,2016,16.0,759,758,46,54,58618,68813,0.851852
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
790,1814,12,yale university,United States of America,86.5,64.3,87.8,97.2,43.3,87.4,...,50 : 50,2016,87.4,12,12,50,50,5876,5876,1.000000
792,2503,601-800,yeungnam university,South Korea,18.6,24.3,10.9,26.5,35.4,-,...,48 : 52,2016,19.5,701,701,48,52,10540,11418,0.923077
794,2540,601-800,yokohama national university,Japan,20.1,23.3,16.0,13.5,40.4,-,...,28 : 72,2016,17.6,738,737,28,72,2833,7284,0.388889
797,2458,601-800,yuan ze university,Taiwan,16.2,17.7,18.3,28.6,39.8,-,...,43 : 57,2016,21.3,656,653,43,57,3725,4938,0.754386
798,2086,251-300,zhejiang university,China,44.3,19.6,46.0,36.1,96.2,-,...,41 : 59,2016,41.8,284,284,41,59,19478,28030,0.694915

# **7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country)**

In [108]:
ratio_inf_country = ratio_inf.groupby('country')['num_students'].sum().reset_index(name ='Sum_inf_avg_ratio')
ratio_inf_country.head()

      country  Sum_inf_avg_ratio
0   Australia             160839
1     Austria              53607
2  Bangladesh              62716
3      Brazil             375248
4      Canada              86779

In [109]:
times_most_recent_grouped = times_most_recent.groupby('country')['num_students'].sum().reset_index(name ='Sum_total_country')
times_most_recent_grouped

                     country  Sum_total_country
0                  Argentina             108373
1                  Australia             641705
2                    Austria             127051
3                 Bangladesh              62716
4                    Belarus              29303
5                    Belgium             169661
6                     Brazil             494251
7                     Canada             623629
8                      Chile              61744
9                      China             993461
10                  Colombia              54645
11                    Cyprus               6880
12            Czech Republic             175871
13                   Denmark             119355
14                     Egypt             376189
15                   Estonia              24330
16                   Finland             100018
17                    France             650488
18                   Germany             918502
19                     Ghana              37274
20                    Greece             202013
21                 Hong Kong              80271
22                   Hungary              87765
23                   Iceland              13960
24                     India             155370
25                 Indonesia              43565
26                      Iran             138992
27                    Israel              83423
28                     Italy            1042840
29                     Japan             447601
30                    Jordan              60263
31                     Kenya              72676
32                    Latvia              15100
33                   Lebanon               7695
34                 Lithuania              19019
35                Luxembourg               5144
36                     Macau               8521
37                  Malaysia             161827
38                    Mexico             151731
39                   Morocco              56060
40               Netherlands             225877
41               New Zealand              89834
42                   Nigeria              26247
43                    Norway              39402
44                      Oman               7089
45                  Pakistan              22496
46                    Poland             190741
47                  Portugal             116041
48                     Qatar               9583
49       Republic of Ireland              90116
50                   Romania             108378
51        Russian Federation             204172
52              Saudi Arabia              35889
53                    Serbia              96968
54                 Singapore              56620
55                  Slovakia              37279
56                  Slovenia              48821
57              South Africa             330198
58               South Korea             276058
59                     Spain             749668
60                    Sweden             132622
61               Switzerland             118976
62                    Taiwan             276543
63                  Thailand             210122
64                    Turkey             639342
65                    Uganda              37340
66                   Ukraine              37096
67      United Arab Emirates              14447
68            United Kingdom            1324842
69  United States of America            3157775

In [110]:
merged = pd.merge(times_most_recent_grouped, ratio_inf_country, on= 'country')

In [112]:
merged['prop_inf_avg'] = merged['Sum_inf_avg_ratio']/merged['Sum_total_country']
merged.head()

      country  Sum_total_country  Sum_inf_avg_ratio  prop_inf_avg
0   Australia             641705             160839      0.250643
1     Austria             127051              53607      0.421933
2  Bangladesh              62716              62716      1.000000
3      Brazil             494251             375248      0.759226
4      Canada             623629              86779      0.139152

# **8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name**

In [113]:
attainment= pd.read_csv(r'C:\Users\valen\OneDrive\Documenti\Data science\Foundations of computer science\ProgettoCS\educational_attainment_supplementary_data.csv')

In [114]:
attainment.isnull()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,False,False,False,True,True,False,True,True,True,False,...,False,True,True,True,True,False,True,True,True,True
1,False,False,False,True,True,False,True,True,True,False,...,False,True,True,True,True,False,True,True,True,True
2,False,False,False,True,True,False,True,True,True,False,...,False,True,True,True,True,False,True,True,True,True
3,False,False,False,True,True,False,True,True,True,False,...,False,True,True,True,True,False,True,True,True,True
4,False,False,False,True,True,False,True,True,True,False,...,False,True,True,True,True,False,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
79050,True,True,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True
79051,True,True,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True
79052,True,True,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True
79053,False,True,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True
79054,False,True,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True

In [115]:
attainment = attainment[attainment['country_name'].notna()]

In [116]:
attainment = attainment[attainment['series_name'].notna()]

In [117]:
attainment[attainment['country_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

In [118]:
attainment[attainment['series_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

# **9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value**

In [119]:
attainment.head(5)

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [120]:
attainment_mod = attainment.melt(id_vars=["country_name", "series_name"], var_name="Year", value_name="Value")

In [121]:
attainment_mod.head(5)

  country_name                                        series_name  Year  Value
0  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.33
1  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   1.03
2  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.83
3  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   2.34
4  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.54

# **10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).**

In [122]:
shanghai_new = shanghai['university_name'].unique()

In [123]:
times_new = times['university_name'].unique()

In [124]:
cwur_new = cwur['university_name'].unique()

In [125]:
rank_list = [shanghai_new, cwur_new, times_new]  
concat_rankings = np.concatenate(rank_list)

In [126]:
occorrenze = collections.Counter(concat_rankings)
occorrenze

Counter({'harvard university': 3,
         'university of cambridge': 3,
         'stanford university': 3,
         'university of california berkeley': 3,
         'massachusetts institute of technology mit': 3,
         'california institute of technology': 3,
         'columbia university': 3,
         'princeton university': 3,
         'university of chicago': 3,
         'university of oxford': 3,
         'yale university': 3,
         'cornell university': 3,
         'university of california san diego': 3,
         'university of california los angeles': 3,
         'university of pennsylvania': 3,
         'university of wisconsin  madison': 1,
         'university of washington  seattle': 3,
         'university of california san francisco': 3,
         'the johns hopkins university': 3,
         'the university of tokyo': 1,
         'university of michigan  ann arbor': 1,
         'kyoto university': 3,
         'the imperial college of science technology and medicine': 1,
         'university of toronto': 3,
         'university of illinois at urbana champaign': 3,
         'university college london': 3,
         'swiss federal institute of technology in zurich': 1,
         'washington university in st louis': 3,
         'new york university': 3,
         'rockefeller university': 2,
         'northwestern university': 3,
         'university of minnesota twin cities': 2,
         'duke university': 3,
         'university of california santa barbara': 3,
         'university of colorado at boulder': 3,
         'the university of texas at austin': 3,
         'university of british columbia': 3,
         'the university of texas southwestern medical center at dallas': 1,
         'pennsylvania state university  university park': 1,
         'vanderbilt university': 3,
         'university of california davis': 3,
         'utrecht university': 3,
         'university of pittsburgh pittsburgh campus': 2,
         'rutgers the state university of new jersey  newark': 3,
         'karolinska institute': 3,
         'pierre and marie curie university  paris 6': 3,
         'the university of edinburgh': 3,
         'university of california irvine': 3,
         'university of maryland college park': 3,
         'university of southern california': 3,
         'university of munich': 1,
         'technical university munich': 3,
         'the university of manchester': 3,
         'carnegie mellon university': 3,
         'university of north carolina at chapel hill': 3,
         'the australian national university': 3,
         'university of south florida': 3,
         'university of copenhagen': 3,
         'university of zurich': 3,
         'uppsala university': 3,
         'university of paris sud': 3,
         'osaka university': 3,
         'ohio state university columbus': 3,
         'university of bristol': 3,
         'the university of sheffield': 3,
         'university of rochester': 3,
         'mcgill university': 3,
         'moscow state university': 3,
         'case western reserve university': 3,
         'university of oslo': 3,
         'university of heidelberg': 1,
         'leiden university': 3,
         'tohoku university': 3,
         'university of arizona': 3,
         'purdue university  west lafayette': 1,
         'university of helsinki': 3,
         'michigan state university': 3,
         'rice university': 3,
         'the hebrew university of jerusalem': 3,
         'boston university': 3,
         'king s college london': 3,
         'the university of melbourne': 3,
         'university of nottingham': 3,
         'university of goettingen': 1,
         'medical university of vienna': 3,
         'brown university': 3,
         'indiana university bloomington': 1,
         'university of basel': 3,
         'texas a m university  college station': 1,
         'mcmaster university': 3,
         'university of freiburg': 2,
         'university of strasbourg': 3,
         'ecole normale superieure  paris': 1,
         'stockholm university': 3,
         'university of utah': 3,
         'tokyo institute of technology': 3,
         'university of roma  la sapienza': 1,
         'university of birmingham': 3,
         'lund university': 3,
         'tufts university': 3,
         'university of massachusetts amherst': 2,
         'nagoya university': 3,
         'university of iowa': 3,
         'technion israel institute of technology': 2,
         'tel aviv university': 3,
         'university of virginia': 3,
         'university of liverpool': 3,
         'arizona state university  tempe': 3,
         'university of technology sydney': 3,
         'university of alberta': 3,
         'university of frankfurt': 1,
         'aarhus university': 3,
         'university of wuerzburg': 1,
         'university of bonn': 3,
         'university of tuebingen': 1,
         'oregon state university': 3,
         'baylor college of medicine': 2,
         'georgia institute of technology': 3,
         'university of amsterdam': 3,
         'ghent university': 3,
         'emory university': 3,
         'weizmann institute of science': 2,
         'university of groningen': 3,
         'the university of georgia': 3,
         'university of hawaii at manoa': 2,
         'university of illinois at chicago': 3,
         'university of california riverside': 3,
         'university of pisa': 3,
         'university of geneva': 3,
         'university of muenster': 1,
         'dartmouth college': 3,
         'university of california santa cruz': 3,
         'university of leeds': 3,
         'north carolina state university  raleigh': 3,
         'catholic university of louvain': 1,
         'polytechnic university of milan': 3,
         'university of tsukuba': 3,
         'state university of new york at stony brook': 1,
         'federal university of sao paulo': 1,
         'national university of singapore': 3,
         'university libre bruxelles': 1,
         'kyushu university': 3,
         'university of hamburg': 3,
         'the university of glasgow': 3,
         'seoul national university': 3,
         'university of sussex': 3,
         'university of miami': 3,
         'mayo medical school': 1,
         'university of queensland': 3,
         'catholic university of leuven': 1,
         'college of france': 1,
         'hokkaido university': 3,
         'university of tennessee  knoxville': 1,
         'university paris diderot  paris 7': 1,
         'swiss federal institute of technology lausanne': 1,
         'university of kiel': 3,
         'virginia commonwealth university': 2,
         'university of cincinnati': 3,
         'university of bern': 3,
         'national autonomous university of mexico': 3,
         'colorado state university': 2,
         'iowa state university': 3,
         'university of montreal': 3,
         'the university of new south wales': 3,
         'university of delaware': 3,
         'university of texas health science center at houston': 2,
         'university of wageningen': 1,
         'university of nebraska  lincoln': 2,
         'vu university amsterdam': 3,
         'university of alabama at birmingham': 2,
         'virginia polytechnic institute and state university': 3,
         'florida state university': 3,
         'university of southampton': 3,
         'oregon health  science university': 3,
         'university of koeln': 1,
         'university of maryland baltimore': 3,
         'university of texas md anderson cancer center': 2,
         'technical university of denmark': 3,
         'the university of western australia': 3,
         'the university of connecticut  storrs': 1,
         'university of mainz': 1,
         'national taiwan normal university': 3,
         'university of leicester': 3,
         'cardiff university': 3,
         'university of padua': 3,
         'university of notre dame': 3,
         'tsinghua university': 3,
         'autonomous university of barcelona': 3,
         'joseph fourier university grenoble 1': 3,
         'university of gothenburg': 3,
         'the university of calgary': 3,
         'university of leipzig': 1,
         'university of marburg': 2,
         'queen s university': 3,
         'mount sinai school of medicine': 1,
         'erasmus university': 1,
         'brandeis university': 3,
         'university of east anglia': 3,
         'autonomous university of madrid': 3,
         'university of turin': 3,
         'university of paris dauphine paris 9': 1,
         'university of waterloo': 3,
         'rensselaer polytechnic institute': 3,
         'university of oregon': 3,
         'the university of auckland': 1,
         'newcastle university': 3,
         'royal institute of technology': 3,
         'washington state university  pullman': 1,
         'university of florence': 3,
         'dalhousie university': 3,
         'yeshiva university': 3,
         'george mason university': 3,
         'university of durham': 1,
         'university of kentucky': 3,
         'western university the university of western ontario': 3,
         'radboud university nijmegen': 3,
         'university of montpellier 2': 2,
         'the university of new mexico  albuquerque': 1,
         'medical university of innsbruck': 3,
         'university of missouri  columbia': 1,
         'university of st andrews': 3,
         'the university of hong kong': 1,
         'monash university': 3,
         'university of colorado health science center': 1,
         'university of bologna': 3,
         'university of massachusetts medical school': 2,
         'university of bochum': 1,
         'university of medicine and dentistry new jersey': 2,
         'the hong kong university of science and technology': 3,
         'university at buffalo the state university of new york': 1,
         'university of vermont': 3,
         'queen mary u of london': 3,
         'university of south carolina  columbia': 3,
         'university of erlangen nuremberg': 3,
         'delft university of technology': 3,
         'the university of adelaide': 3,
         'university of cape town': 3,
         'laval university': 3,
         'paul sabatier university  toulouse iii': 2,
         'the george washington university': 3,
         'university of houston': 3,
         'peking university': 3,
         'louisiana state university  baton rouge': 2,
         'university at albany state university of new york': 2,
         'yonsei university': 3,
         'university of saskatchewan': 3,
         'umea university': 1,
         'university of kansas  lawrence': 3,
         'the university of reading': 3,
         'kobe university': 3,
         'ecole polytechnique': 1,
         'technical university of berlin': 3,
         'university of karlsruhe': 1,
         'university of south florida  tampa': 3,
         'trinity college dublin': 3,
         'hiroshima university': 3,
         'university of antwerp': 3,
         'swedish university of agricultural sciences': 3,
         'university of york': 3,
         'university of texas health science center at san antonio': 2,
         'chalmers university of technology': 3,
         'thomas jefferson university': 2,
         'wake forest university': 3,
         'university of warwick': 3,
         'keio university': 3,
         'university of ottawa': 3,
         'university of manitoba': 3,
         'university of texas medical branch at galveston': 2,
         'georgetown university': 3,
         'wayne state university': 3,
         'rwth aachen university': 3,
         'university of liege': 1,
         'university of southern denmark': 3,
         'university of turku': 3,
         'university of guelph': 3,
         'university of buenos aires': 2,
         'university of halle wittenberg': 1,
         'university of naples federico ii': 3,
         'tulane university': 3,
         'university of alaska  fairbanks': 1,
         'charles university in prague': 3,
         'macquarie university': 3,
         'claude bernard university lyon 1': 3,
         'queen s university belfast': 3,
         'syracuse university': 3,
         'the university of dundee': 3,
         'lancaster university': 3,
         'okayama university': 3,
         'kansas state university': 3,
         'university of campinas': 3,
         'university of szeged': 3,
         'victoria university of wellington': 3,
         'university of bordeaux ii': 3,
         'complutense university of madrid': 3,
         'norwegian university of science and technology  ntnu': 3,
         'university of stuttgart': 3,
         'national and kapodistrian university of athens': 3,
         'university of genova': 1,
         'polytechnic institute of milan': 1,
         'zhejiang university': 3,
         'university of otago': 3,
         'university of twente': 3,
         'simon fraser university': 3,
         'university of new hampshire': 2,
         'university of regensburg': 2,
         'university of the mediterranean aix marseille 2': 1,
         'university of ulm': 2,
         'university of bath': 3,
         'indian institute of science': 3,
         'warsaw university of technology': 3,
         'henri poincare university nancy 1': 1,
         'university of bielefeld': 1,
         'university of rhode island': 2,
         'city college of new york': 2,
         'london school of economics and political science': 2,
         'niigata university': 3,
         'university of electronic science and technology of china': 3,
         'texas tech university ttu': 3,
         'university of pavia': 3,
         'the open university': 2,
         'temple university': 3,
         'state university of new york health science center at brooklyn': 1,
         'clemson university': 3,
         'saint petersburg state university': 3,
         'university of montana  missoula': 3,
         'university of aberdeen': 3,
         'university of duesseldorf': 1,
         'saint louis university': 3,
         'pohang university of science and technology': 3,
         'nanjing university': 3,
         'university of oklahoma  norman campus': 2,
         'city university of hong kong': 3,
         'university of konstanz': 3,
         'ben gurion university of the negev': 3,
         'shanghai jiao tong university': 3,
         'dresden university of technology': 2,
         'university of south carolina': 3,
         'korea advanced institute of science and technology': 3,
         'university of lausanne': 3,
         'bar ilan university': 3,
         'the hong kong polytechnic university': 3,
         'kanazawa university': 3,
         'federal university of rio de janeiro': 3,
         'san diego state university': 3,
         'fudan university': 3,
         'university of nevada  reno': 1,
         'technical university darmstadt': 2,
         'industrial physics and chemistry higher educational institution  paris': 1,
         'university of bayreuth': 2,
         'university of newcastle': 3,
         'national tsing hua university': 3,
         'university of greifswald': 3,
         'university of bergen': 3,
         'carleton university': 3,
         'polytechnic university of valencia': 3,
         'university of perugia': 2,
         'eotvos lorand university': 1,
         'london school of hygiene  tropical medicine': 2,
         'waseda university': 3,
         'indiana university purdue university indianapolis': 2,
         'brigham young university': 2,
         'tokyo medical and dental university': 3,
         'university of the witwatersrand': 3,
         'yamaguchi university': 2,
         'medical university of graz': 3,
         'linkoping university': 1,
         'aristotle university of thessaloniki': 3,
         'international school for advanced studies': 2,
         'nanyang technological university': 3,
         'paris dauphine university paris 9': 2,
         'eindhoven university of technology': 3,
         'vienna university of technology': 3,
         'ecole national superieure mines  paris': 1,
         'technical university of braunschweig': 1,
         'utah state university': 2,
         'university of tokushima': 2,
         'chiba university': 3,
         'scuola normale superiore  pisa': 3,
         'medical college of wisconsin': 3,
         'tokyo university of agriculture and technology': 3,
         'jagiellonian university': 3,
         'university of palermo': 3,
         'the university of texas at dallas': 3,
         'university of wyoming': 3,
         'university of essex': 3,
         'gunma university': 2,
         'ecole normale superieure  lyon': 1,
         'royal holloway u of london': 3,
         'university of roma  tor vergata': 1,
         'auburn university': 3,
         'nagasaki university': 3,
         'national cheng kung university': 3,
         'university of nebraska medical center': 3,
         'catholic university of chile': 3,
         'university of cagliari': 3,
         'sungkyunkwan university': 2,
         'northeastern university': 3,
         'university of jena': 2,
         'drexel university': 3,
         'tokyo metropolitan university': 3,
         'nihon university': 2,
         'university of ferrara': 3,
         'university of tasmania': 3,
         'university of exeter': 3,
         'the royal veterinary and agricultural university': 1,
         'victor segalen bordeaux 2 university': 1,
         'the university of connecticut health center': 1,
         'university of louisville': 2,
         'howard university': 3,
         'university of fribourg': 3,
         'new mexico state university': 3,
         'university of bremen': 3,
         'university of central florida': 2,
         'michigan technological university': 3,
         'la trobe university': 3,
         'college of william and mary': 2,
         'vrije university brussel': 1,
         'aalto university': 3,
         'ehime university': 3,
         'gifu university': 3,
         'southern methodist university': 3,
         'florida international university': 3,
         'university of maastricht': 1,
         'lehigh university': 3,
         'university of giessen': 1,
         'indian institute of technology kharagpur': 3,
         'university of sevilla': 1,
         'university of zaragoza': 3,
         'university of sherbrooke': 2,
         'university of jyvaskyla': 1,
         'university college dublin': 3,
         'university college cork': 3,
         'university of quebec': 1,
         'university of granada': 3,
         'university of haifa': 3,
         'university of provence aix marseille 1': 1,
         'university of kwazulu natal': 3,
         'kagoshima university': 2,
         'nara institute of science and technology': 2,
         'york university': 3,
         'boston college': 3,
         'flinders university': 3,
         'university of wisconsin  milwaukee': 2,
         'university of rostock': 2,
         'university of maine orono': 2,
         'korea university': 3,
         'university of duisburg essen': 3,
         'osaka prefecture university': 3,
         'hanyang university': 3,
         'university of akron': 2,
         'massey university': 3,
         'medical college of georgia': 1,
         'kumamoto university': 3,
         'university of idaho': 3,
         'northern arizona university': 2,
         'saarland university': 2,
         'university of oulu': 3,
         'university of trieste': 3,
         'jilin university': 3,
         'osaka city university': 3,
         'university of surrey': 3,
         'university of lisbon': 3,
         'university of tromso': 1,
         'national yang ming university': 3,
         'national chiao tung university': 3,
         'stockholm school of economics': 1,
         'university of canterbury': 3,
         'university of mississippi': 3,

# **11. In the times ranking, compute the number of times each university appears**

In [127]:
rank_univ_times = times.groupby('university_name')['year'].count().reset_index(name = 'count')
rank_univ_times

                  university_name  count
0              aalborg university      5
1                aalto university      5
2               aarhus university      6
3          aberystwyth university      5
4      adam mickiewicz university      1
..                            ...    ...
794  yokohama national university      1
795             yonsei university      6
796               york university      5
797            yuan ze university      2
798           zhejiang university      6

[799 rows x 2 columns]

# **12. Find the universities that appear at most twice in the times ranking.**

In [128]:
rank_univ_times[rank_univ_times['count']<=2]

                              university_name  count
4                  adam mickiewicz university      1
5    agh university of science and technology      1
6                    aix marseille university      1
7                             ajou university      1
9              alexandru ioan cuza university      1
..                                        ...    ...
789               y ld z technical university      1
792                       yeungnam university      1
793                  yokohama city university      1
794              yokohama national university      1
797                        yuan ze university      2

[395 rows x 2 columns]

# **13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).**

**Con procedimento alternativo proposto al punto 4 (ricalcolo dello score per attribuzione ranking)**

In [ ]:
shanghai_n = shanghai[['university_name', 'year', 'new_world_ranking_sha']]

In [ ]:
times_n = times[['university_name', 'year', 'new_world_ranking_times']]

In [ ]:
cwur_n = cwur[['university_name', 'year', 'world_rank_cwur']]

In [ ]:
merged_rankings_n = shanghai_n.merge(cwur_n,on=['university_name', 'year'], how = 'outer').merge(times_n,on=['university_name', 'year'], how='outer')[['university_name','year','new_world_ranking_sha','new_world_ranking_times','world_rank_cwur']]

In [ ]:
merged_rankings_n = merged_rankings_n.fillna(0)

In [ ]:
merged_rankings_match_n = merged_rankings_n[(merged_rankings_n['new_world_ranking_sha']!= 0)&(merged_rankings_n['new_world_ranking_times']!= 0)&(merged_rankings_n['world_rank_cwur'] != 0)]

In [ ]:
merged_rankings_match_n

In [ ]:
same_rank = merged_rankings_n[merged_rankings_n[['new_world_ranking_sha','new_world_ranking_times','world_rank_cwur']].nunique(axis=1) == 1]
same_rank